MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4400-F100F512/mcu.h
/* ---------------------------------  PORT4_PDR0  --------------------------------- */
#define PORT4_PDR0_PD0_Pos                    (0UL)                     /*!< PORT4 PDR0: PD0 (Bit 0)                                     */
#define PORT4_PDR0_PD0_Msk                    (0x7UL)                   /*!< PORT4 PDR0: PD0 (Bitfield-Mask: 0x07)                       */
#define PORT4_PDR0_PD1_Pos                    (4UL)                     /*!< PORT4 PDR0: PD1 (Bit 4)                                     */
#define PORT4_PDR0_PD1_Msk                    (0x70UL)                  /*!< PORT4 PDR0: PD1 (Bitfield-Mask: 0x07)                       */
#define PORT4_PDR0_PD2_Pos                    (8UL)                     /*!< PORT4 PDR0: PD2 (Bit 8)                                     */
#define PORT4_PDR0_PD2_Msk                    (0x700UL)                 /*!< PORT4 PDR0: PD2 (Bitfield-Mask: 0x07)                       */
#define PORT4_PDR0_PD3_Pos                    (12UL)                    /*!< PORT4 PDR0: PD3 (Bit 12)                                    */
#define PORT4_PDR0_PD3_Msk                    (0x7000UL)                /*!< PORT4 PDR0: PD3 (Bitfield-Mask: 0x07)                       */
#define PORT4_PDR0_PD4_Pos                    (16UL)                    /*!< PORT4 PDR0: PD4 (Bit 16)                                    */
#define PORT4_PDR0_PD4_Msk                    (0x70000UL)               /*!< PORT4 PDR0: PD4 (Bitfield-Mask: 0x07)                       */
#define PORT4_PDR0_PD5_Pos                    (20UL)                    /*!< PORT4 PDR0: PD5 (Bit 20)                                    */
#define PORT4_PDR0_PD5_Msk                    (0x700000UL)              /*!< PORT4 PDR0: PD5 (Bitfield-Mask: 0x07)                       */
#define PORT4_PDR0_PD6_Pos                    (24UL)                    /*!< PORT4 PDR0: PD6 (Bit 24)                                    */
#define PORT4_PDR0_PD6_Msk                    (0x7000000UL)             /*!< PORT4 PDR0: PD6 (Bitfield-Mask: 0x07)                       */
#define PORT4_PDR0_PD7_Pos                    (28UL)                    /*!< PORT4 PDR0: PD7 (Bit 28)                                    */
#define PORT4_PDR0_PD7_Msk                    (0x70000000UL)            /*!< PORT4 PDR0: PD7 (Bitfield-Mask: 0x07)                       */

/* ---------------------------------  PORT4_PDISC  -------------------------------- */
#define PORT4_PDISC_PDIS0_Pos                 (0UL)                     /*!< PORT4 PDISC: PDIS0 (Bit 0)                                  */
#define PORT4_PDISC_PDIS0_Msk                 (0x1UL)                   /*!< PORT4 PDISC: PDIS0 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS1_Pos                 (1UL)                     /*!< PORT4 PDISC: PDIS1 (Bit 1)                                  */
#define PORT4_PDISC_PDIS1_Msk                 (0x2UL)                   /*!< PORT4 PDISC: PDIS1 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS2_Pos                 (2UL)                     /*!< PORT4 PDISC: PDIS2 (Bit 2)                                  */
#define PORT4_PDISC_PDIS2_Msk                 (0x4UL)                   /*!< PORT4 PDISC: PDIS2 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS3_Pos                 (3UL)                     /*!< PORT4 PDISC: PDIS3 (Bit 3)                                  */
#define PORT4_PDISC_PDIS3_Msk                 (0x8UL)                   /*!< PORT4 PDISC: PDIS3 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS4_Pos                 (4UL)                     /*!< PORT4 PDISC: PDIS4 (Bit 4)                                  */
#define PORT4_PDISC_PDIS4_Msk                 (0x10UL)                  /*!< PORT4 PDISC: PDIS4 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS5_Pos                 (5UL)                     /*!< PORT4 PDISC: PDIS5 (Bit 5)                                  */
#define PORT4_PDISC_PDIS5_Msk                 (0x20UL)                  /*!< PORT4 PDISC: PDIS5 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS6_Pos                 (6UL)                     /*!< PORT4 PDISC: PDIS6 (Bit 6)                                  */
#define PORT4_PDISC_PDIS6_Msk                 (0x40UL)                  /*!< PORT4 PDISC: PDIS6 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS7_Pos                 (7UL)                     /*!< PORT4 PDISC: PDIS7 (Bit 7)                                  */
#define PORT4_PDISC_PDIS7_Msk                 (0x80UL)                  /*!< PORT4 PDISC: PDIS7 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS8_Pos                 (8UL)                     /*!< PORT4 PDISC: PDIS8 (Bit 8)                                  */
#define PORT4_PDISC_PDIS8_Msk                 (0x100UL)                 /*!< PORT4 PDISC: PDIS8 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS9_Pos                 (9UL)                     /*!< PORT4 PDISC: PDIS9 (Bit 9)                                  */
#define PORT4_PDISC_PDIS9_Msk                 (0x200UL)                 /*!< PORT4 PDISC: PDIS9 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS10_Pos                (10UL)                    /*!< PORT4 PDISC: PDIS10 (Bit 10)                                */
#define PORT4_PDISC_PDIS10_Msk                (0x400UL)                 /*!< PORT4 PDISC: PDIS10 (Bitfield-Mask: 0x01)                   */
#define PORT4_PDISC_PDIS11_Pos                (11UL)                    /*!< PORT4 PDISC: PDIS11 (Bit 11)                                */
#define PORT4_PDISC_PDIS11_Msk                (0x800UL)                 /*!< PORT4 PDISC: PDIS11 (Bitfield-Mask: 0x01)                   */
#define PORT4_PDISC_PDIS12_Pos                (12UL)                    /*!< PORT4 PDISC: PDIS12 (Bit 12)                                */
#define PORT4_PDISC_PDIS12_Msk                (0x1000UL)                /*!< PORT4 PDISC: PDIS12 (Bitfield-Mask: 0x01)                   */
#define PORT4_PDISC_PDIS13_Pos                (13UL)                    /*!< PORT4 PDISC: PDIS13 (Bit 13)                                */
#define PORT4_PDISC_PDIS13_Msk                (0x2000UL)                /*!< PORT4 PDISC: PDIS13 (Bitfield-Mask: 0x01)                   */
#define PORT4_PDISC_PDIS14_Pos                (14UL)                    /*!< PORT4 PDISC: PDIS14 (Bit 14)                                */
#define PORT4_PDISC_PDIS14_Msk                (0x4000UL)                /*!< PORT4 PDISC: PDIS14 (Bitfield-Mask: 0x01)                   */
#define PORT4_PDISC_PDIS15_Pos                (15UL)                    /*!< PORT4 PDISC: PDIS15 (Bit 15)                                */
#define PORT4_PDISC_PDIS15_Msk                (0x8000UL)                /*!< PORT4 PDISC: PDIS15 (Bitfield-Mask: 0x01)                   */

