MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4400-F100F512/mcu.h
#define PPB                             ((PPB_Type                *) PPB_BASE)
#define DLR                             ((DLR_GLOBAL_TypeDef                *) DLR_BASE)
#define ERU0                            ((ERU_GLOBAL_TypeDef                *) ERU0_BASE)
#define ERU1                            ((ERU_GLOBAL_TypeDef                *) ERU1_BASE)
#define GPDMA0                          ((GPDMA0_GLOBAL_TypeDef             *) GPDMA0_BASE)
#define GPDMA0_CH0                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH0_BASE)
#define GPDMA0_CH1                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH1_BASE)
#define GPDMA0_CH2                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH2_BASE)
#define GPDMA0_CH3                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH3_BASE)
#define GPDMA0_CH4                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH4_BASE)
#define GPDMA0_CH5                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH5_BASE)
#define GPDMA0_CH6                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH6_BASE)
#define GPDMA0_CH7                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH7_BASE)
#define FCE                             ((FCE_GLOBAL_TypeDef                *) FCE_BASE)
#define FCE_KE0                         ((FCE_KE_TypeDef             *) FCE_KE0_BASE)
#define FCE_KE1                         ((FCE_KE_TypeDef             *) FCE_KE1_BASE)
#define FCE_KE2                         ((FCE_KE_TypeDef             *) FCE_KE2_BASE)
#define FCE_KE3                         ((FCE_KE_TypeDef             *) FCE_KE3_BASE)
#define PBA0                            ((PBA_GLOBAL_TypeDef                *) PBA0_BASE)
#define PBA1                            ((PBA_GLOBAL_TypeDef                *) PBA1_BASE)
#define FLASH0                          ((FLASH0_GLOBAL_TypeDef              *) FLASH0_BASE)
#define PREF                            ((PREF_GLOBAL_TypeDef               *) PREF_BASE)
#define PMU0                            ((PMU0_GLOBAL_TypeDef                *) PMU0_BASE)
#define WDT                             ((WDT_GLOBAL_TypeDef                *) WDT_BASE)
#define RTC                             ((RTC_GLOBAL_TypeDef                *) RTC_BASE)
#define SCU_CLK                         ((SCU_CLK_TypeDef            *) SCU_CLK_BASE)
#define SCU_OSC                         ((SCU_OSC_TypeDef            *) SCU_OSC_BASE)
#define SCU_PLL                         ((SCU_PLL_TypeDef            *) SCU_PLL_BASE)
#define SCU_GENERAL                     ((SCU_GENERAL_TypeDef        *) SCU_GENERAL_BASE)
#define SCU_INTERRUPT                   ((SCU_INTERRUPT_TypeDef      *) SCU_INTERRUPT_BASE)
#define SCU_PARITY                      ((SCU_PARITY_TypeDef         *) SCU_PARITY_BASE)
#define SCU_TRAP                        ((SCU_TRAP_TypeDef           *) SCU_TRAP_BASE)
#define SCU_HIBERNATE                   ((SCU_HIBERNATE_TypeDef      *) SCU_HIBERNATE_BASE)
#define SCU_POWER                       ((SCU_POWER_TypeDef          *) SCU_POWER_BASE)
#define SCU_RESET                       ((SCU_RESET_TypeDef          *) SCU_RESET_BASE)
#define LEDTS0                          ((LEDTS0_GLOBAL_TypeDef              *) LEDTS0_BASE)
#define ETH0_CON                        ((ETH0_CON_GLOBAL_TypeDef           *) ETH0_CON_BASE)
#define ETH0                            ((ETH_GLOBAL_TypeDef                *) ETH0_BASE)
#define USB0                            ((USB0_GLOBAL_TypeDef                *) USB0_BASE)
#define USB0_EP0                        ((USB0_EP0_TypeDef           *) USB_EP_BASE)
#define USB0_EP1                        ((USB0_EP_TypeDef             *) USB0_EP1_BASE)
#define USB0_EP2                        ((USB0_EP_TypeDef             *) USB0_EP2_BASE)
#define USB0_EP3                        ((USB0_EP_TypeDef             *) USB0_EP3_BASE)
#define USB0_EP4                        ((USB0_EP_TypeDef             *) USB0_EP4_BASE)
#define USB0_EP5                        ((USB0_EP_TypeDef             *) USB0_EP5_BASE)
#define USB0_EP6                        ((USB0_EP_TypeDef             *) USB0_EP6_BASE)
#define USB0_CH0                        ((USB0_CH_TypeDef             *) USB0_CH0_BASE)
#define USB0_CH1                        ((USB0_CH_TypeDef             *) USB0_CH1_BASE)
#define USB0_CH2                        ((USB0_CH_TypeDef             *) USB0_CH2_BASE)
#define USB0_CH3                        ((USB0_CH_TypeDef             *) USB0_CH3_BASE)
#define USB0_CH4                        ((USB0_CH_TypeDef             *) USB0_CH4_BASE)
#define USB0_CH5                        ((USB0_CH_TypeDef             *) USB0_CH5_BASE)
#define USB0_CH6                        ((USB0_CH_TypeDef             *) USB0_CH6_BASE)
#define USB0_CH7                        ((USB0_CH_TypeDef             *) USB0_CH7_BASE)
#define USB0_CH8                        ((USB0_CH_TypeDef             *) USB0_CH8_BASE)
#define USB0_CH9                        ((USB0_CH_TypeDef             *) USB0_CH9_BASE)
#define USB0_CH10                       ((USB0_CH_TypeDef             *) USB0_CH10_BASE)
#define USB0_CH11                       ((USB0_CH_TypeDef             *) USB0_CH11_BASE)
#define USB0_CH12                       ((USB0_CH_TypeDef             *) USB0_CH12_BASE)
#define USB0_CH13                       ((USB0_CH_TypeDef             *) USB0_CH13_BASE)
#define USIC0                           ((USIC_GLOBAL_TypeDef               *) USIC0_BASE)
#define USIC1                           ((USIC_GLOBAL_TypeDef               *) USIC1_BASE)
#define USIC0_CH0                       ((USIC_CH_TypeDef            *) USIC0_CH0_BASE)
#define USIC0_CH1                       ((USIC_CH_TypeDef            *) USIC0_CH1_BASE)
#define USIC1_CH0                       ((USIC_CH_TypeDef            *) USIC1_CH0_BASE)
#define USIC1_CH1                       ((USIC_CH_TypeDef            *) USIC1_CH1_BASE)
#define CAN                             ((CAN_GLOBAL_TypeDef                *) CAN_BASE)
#define CAN_NODE0                       ((CAN_NODE_TypeDef           *) CAN_NODE0_BASE)
#define CAN_NODE1                       ((CAN_NODE_TypeDef           *) CAN_NODE1_BASE)
#define CAN_MO0                         ((CAN_MO_TypeDef             *) CAN_MO0_BASE)
#define CAN_MO1                         ((CAN_MO_TypeDef             *) CAN_MO1_BASE)
#define CAN_MO2                         ((CAN_MO_TypeDef             *) CAN_MO2_BASE)
#define CAN_MO3                         ((CAN_MO_TypeDef             *) CAN_MO3_BASE)
#define CAN_MO4                         ((CAN_MO_TypeDef             *) CAN_MO4_BASE)
#define CAN_MO5                         ((CAN_MO_TypeDef             *) CAN_MO5_BASE)
#define CAN_MO6                         ((CAN_MO_TypeDef             *) CAN_MO6_BASE)
#define CAN_MO7                         ((CAN_MO_TypeDef             *) CAN_MO7_BASE)
#define CAN_MO8                         ((CAN_MO_TypeDef             *) CAN_MO8_BASE)
#define CAN_MO9                         ((CAN_MO_TypeDef             *) CAN_MO9_BASE)
#define CAN_MO10                        ((CAN_MO_TypeDef             *) CAN_MO10_BASE)
#define CAN_MO11                        ((CAN_MO_TypeDef             *) CAN_MO11_BASE)
#define CAN_MO12                        ((CAN_MO_TypeDef             *) CAN_MO12_BASE)
#define CAN_MO13                        ((CAN_MO_TypeDef             *) CAN_MO13_BASE)
#define CAN_MO14                        ((CAN_MO_TypeDef             *) CAN_MO14_BASE)
#define CAN_MO15                        ((CAN_MO_TypeDef             *) CAN_MO15_BASE)
#define CAN_MO16                        ((CAN_MO_TypeDef             *) CAN_MO16_BASE)
#define CAN_MO17                        ((CAN_MO_TypeDef             *) CAN_MO17_BASE)
#define CAN_MO18                        ((CAN_MO_TypeDef             *) CAN_MO18_BASE)
#define CAN_MO19                        ((CAN_MO_TypeDef             *) CAN_MO19_BASE)
#define CAN_MO20                        ((CAN_MO_TypeDef             *) CAN_MO20_BASE)
#define CAN_MO21                        ((CAN_MO_TypeDef             *) CAN_MO21_BASE)
#define CAN_MO22                        ((CAN_MO_TypeDef             *) CAN_MO22_BASE)
#define CAN_MO23                        ((CAN_MO_TypeDef             *) CAN_MO23_BASE)
#define CAN_MO24                        ((CAN_MO_TypeDef             *) CAN_MO24_BASE)
#define CAN_MO25                        ((CAN_MO_TypeDef             *) CAN_MO25_BASE)
#define CAN_MO26                        ((CAN_MO_TypeDef             *) CAN_MO26_BASE)
#define CAN_MO27                        ((CAN_MO_TypeDef             *) CAN_MO27_BASE)
#define CAN_MO28                        ((CAN_MO_TypeDef             *) CAN_MO28_BASE)
#define CAN_MO29                        ((CAN_MO_TypeDef             *) CAN_MO29_BASE)
#define CAN_MO30                        ((CAN_MO_TypeDef             *) CAN_MO30_BASE)
#define CAN_MO31                        ((CAN_MO_TypeDef             *) CAN_MO31_BASE)
#define CAN_MO32                        ((CAN_MO_TypeDef             *) CAN_MO32_BASE)
#define CAN_MO33                        ((CAN_MO_TypeDef             *) CAN_MO33_BASE)
#define CAN_MO34                        ((CAN_MO_TypeDef             *) CAN_MO34_BASE)
#define CAN_MO35                        ((CAN_MO_TypeDef             *) CAN_MO35_BASE)
#define CAN_MO36                        ((CAN_MO_TypeDef             *) CAN_MO36_BASE)
#define CAN_MO37                        ((CAN_MO_TypeDef             *) CAN_MO37_BASE)
#define CAN_MO38                        ((CAN_MO_TypeDef             *) CAN_MO38_BASE)
#define CAN_MO39                        ((CAN_MO_TypeDef             *) CAN_MO39_BASE)
#define CAN_MO40                        ((CAN_MO_TypeDef             *) CAN_MO40_BASE)
#define CAN_MO41                        ((CAN_MO_TypeDef             *) CAN_MO41_BASE)
#define CAN_MO42                        ((CAN_MO_TypeDef             *) CAN_MO42_BASE)
#define CAN_MO43                        ((CAN_MO_TypeDef             *) CAN_MO43_BASE)
#define CAN_MO44                        ((CAN_MO_TypeDef             *) CAN_MO44_BASE)
#define CAN_MO45                        ((CAN_MO_TypeDef             *) CAN_MO45_BASE)
#define CAN_MO46                        ((CAN_MO_TypeDef             *) CAN_MO46_BASE)
#define CAN_MO47                        ((CAN_MO_TypeDef             *) CAN_MO47_BASE)
#define CAN_MO48                        ((CAN_MO_TypeDef             *) CAN_MO48_BASE)
#define CAN_MO49                        ((CAN_MO_TypeDef             *) CAN_MO49_BASE)
#define CAN_MO50                        ((CAN_MO_TypeDef             *) CAN_MO50_BASE)
#define CAN_MO51                        ((CAN_MO_TypeDef             *) CAN_MO51_BASE)
#define CAN_MO52                        ((CAN_MO_TypeDef             *) CAN_MO52_BASE)
#define CAN_MO53                        ((CAN_MO_TypeDef             *) CAN_MO53_BASE)
#define CAN_MO54                        ((CAN_MO_TypeDef             *) CAN_MO54_BASE)
#define CAN_MO55                        ((CAN_MO_TypeDef             *) CAN_MO55_BASE)
#define CAN_MO56                        ((CAN_MO_TypeDef             *) CAN_MO56_BASE)
#define CAN_MO57                        ((CAN_MO_TypeDef             *) CAN_MO57_BASE)
#define CAN_MO58                        ((CAN_MO_TypeDef             *) CAN_MO58_BASE)
#define CAN_MO59                        ((CAN_MO_TypeDef             *) CAN_MO59_BASE)
#define CAN_MO60                        ((CAN_MO_TypeDef             *) CAN_MO60_BASE)
#define CAN_MO61                        ((CAN_MO_TypeDef             *) CAN_MO61_BASE)
#define CAN_MO62                        ((CAN_MO_TypeDef             *) CAN_MO62_BASE)
#define CAN_MO63                        ((CAN_MO_TypeDef             *) CAN_MO63_BASE)
#define VADC                            ((VADC_GLOBAL_TypeDef               *) VADC_BASE)
#define VADC_G0                         ((VADC_G_TypeDef             *) VADC_G0_BASE)
#define VADC_G1                         ((VADC_G_TypeDef             *) VADC_G1_BASE)
#define VADC_G2                         ((VADC_G_TypeDef             *) VADC_G2_BASE)
#define VADC_G3                         ((VADC_G_TypeDef             *) VADC_G3_BASE)
#define DSD                             ((DSD_GLOBAL_TypeDef                *) DSD_BASE)
#define DSD_CH0                         ((DSD_CH_TypeDef             *) DSD_CH0_BASE)
#define DSD_CH1                         ((DSD_CH_TypeDef             *) DSD_CH1_BASE)
#define DSD_CH2                         ((DSD_CH_TypeDef             *) DSD_CH2_BASE)
#define DSD_CH3                         ((DSD_CH_TypeDef             *) DSD_CH3_BASE)
#define DAC                             ((DAC_GLOBAL_TypeDef                *) DAC_BASE)
#define CCU40                           ((CCU4_GLOBAL_TypeDef               *) CCU40_BASE)
#define CCU41                           ((CCU4_GLOBAL_TypeDef               *) CCU41_BASE)
#define CCU42                           ((CCU4_GLOBAL_TypeDef               *) CCU42_BASE)
#define CCU43                           ((CCU4_GLOBAL_TypeDef               *) CCU43_BASE)
#define CCU40_CC40                      ((CCU4_CC4_TypeDef           *) CCU40_CC40_BASE)
#define CCU40_CC41                      ((CCU4_CC4_TypeDef           *) CCU40_CC41_BASE)
#define CCU40_CC42                      ((CCU4_CC4_TypeDef           *) CCU40_CC42_BASE)
#define CCU40_CC43                      ((CCU4_CC4_TypeDef           *) CCU40_CC43_BASE)
#define CCU41_CC40                      ((CCU4_CC4_TypeDef           *) CCU41_CC40_BASE)
#define CCU41_CC41                      ((CCU4_CC4_TypeDef           *) CCU41_CC41_BASE)
#define CCU41_CC42                      ((CCU4_CC4_TypeDef           *) CCU41_CC42_BASE)
#define CCU41_CC43                      ((CCU4_CC4_TypeDef           *) CCU41_CC43_BASE)
#define CCU42_CC40                      ((CCU4_CC4_TypeDef           *) CCU42_CC40_BASE)
#define CCU42_CC41                      ((CCU4_CC4_TypeDef           *) CCU42_CC41_BASE)
#define CCU42_CC42                      ((CCU4_CC4_TypeDef           *) CCU42_CC42_BASE)
#define CCU42_CC43                      ((CCU4_CC4_TypeDef           *) CCU42_CC43_BASE)
#define CCU43_CC40                      ((CCU4_CC4_TypeDef           *) CCU43_CC40_BASE)
#define CCU43_CC41                      ((CCU4_CC4_TypeDef           *) CCU43_CC41_BASE)
#define CCU43_CC42                      ((CCU4_CC4_TypeDef           *) CCU43_CC42_BASE)
#define CCU43_CC43                      ((CCU4_CC4_TypeDef           *) CCU43_CC43_BASE)
#define CCU80                           ((CCU8_GLOBAL_TypeDef               *) CCU80_BASE)
#define CCU81                           ((CCU8_GLOBAL_TypeDef               *) CCU81_BASE)
#define CCU80_CC80                      ((CCU8_CC8_TypeDef           *) CCU80_CC80_BASE)
#define CCU80_CC81                      ((CCU8_CC8_TypeDef           *) CCU80_CC81_BASE)
#define CCU80_CC82                      ((CCU8_CC8_TypeDef           *) CCU80_CC82_BASE)
#define CCU80_CC83                      ((CCU8_CC8_TypeDef           *) CCU80_CC83_BASE)
#define CCU81_CC80                      ((CCU8_CC8_TypeDef           *) CCU81_CC80_BASE)
#define CCU81_CC81                      ((CCU8_CC8_TypeDef           *) CCU81_CC81_BASE)
#define CCU81_CC82                      ((CCU8_CC8_TypeDef           *) CCU81_CC82_BASE)
#define CCU81_CC83                      ((CCU8_CC8_TypeDef           *) CCU81_CC83_BASE)
#define HRPWM0                          ((HRPWM0_Type             *) HRPWM0_BASE)
#define HRPWM0_CSG0                     ((HRPWM0_CSG_Type         *) HRPWM0_CSG0_BASE)
#define HRPWM0_CSG1                     ((HRPWM0_CSG_Type         *) HRPWM0_CSG1_BASE)
#define HRPWM0_CSG2                     ((HRPWM0_CSG_Type         *) HRPWM0_CSG2_BASE)
#define HRPWM0_HRC0                     ((HRPWM0_HRC_Type         *) HRPWM0_HRC0_BASE)
#define HRPWM0_HRC1                     ((HRPWM0_HRC_Type         *) HRPWM0_HRC1_BASE)
#define HRPWM0_HRC2                     ((HRPWM0_HRC_Type         *) HRPWM0_HRC2_BASE)
#define HRPWM0_HRC3                     ((HRPWM0_HRC_Type         *) HRPWM0_HRC3_BASE)
#define POSIF0                          ((POSIF_GLOBAL_TypeDef              *) POSIF0_BASE)
#define POSIF1                          ((POSIF_GLOBAL_TypeDef              *) POSIF1_BASE)
#define PORT0                           ((PORT0_Type              *) PORT0_BASE)
#define PORT1                           ((PORT1_Type              *) PORT1_BASE)
#define PORT2                           ((PORT2_Type              *) PORT2_BASE)
#define PORT3                           ((PORT3_Type              *) PORT3_BASE)
#define PORT4                           ((PORT4_Type              *) PORT4_BASE)
#define PORT5                           ((PORT5_Type              *) PORT5_BASE)
#define PORT14                          ((PORT14_Type             *) PORT14_BASE)
#define PORT15                          ((PORT15_Type             *) PORT15_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group XMC4400 */
/** @} */ /* End of group Infineon */

#ifdef __cplusplus
}
#endif


#endif  /* XMC4400_H */

